app/controllers/api/bills_controller.rb

INSERT INTO "bills" ("amount", "description", "bill_date", "author_id", "category", "created_at", "updated_at", "nums_splits") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "billsplits" ("bill_id", "recipient_id", "splited_bill_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bill_id", 13], ["recipient_id", 1], ["splited_bill_amount", 1.0], ["created_at", "2021-05-21 01:45:16.385586"], ["updated_at", "2021-05-21 01:45:16.385586"]]
---
    def create

      split = bill_params[:amount].to_f / (bill_params[:recipients].length + 1)

      @bill = Bill.new(
                      amount: bill_params[:amount].to_f,
                      description: bill_params[:description],
                      bill_date: bill_params[:bill_date],
                      author_id: current_user.id,
                      category: bill_params[:category],
                      nums_splits: bill_params[:recipients].length + 1
                    )
      if @bill.save
        # Create billsplits for each recipient_id
        bill_params[:recipients].each do |id|
          Billsplit.create(bill_id: @bill.id, recipient_id: id, splited_bill_amount: split.round(2) )