app/controllers/api/friendships_controller.rb

    def index
        @friendships = Friendship.where(user_id: params[:user_id])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 33]]

    def create
        @friendship = Friendship.new(friendship_params)

        if @friendship.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 38], ["friend_id", 42], ["created_at", "2021-05-18 20:34:44.407772"], ["updated_at", "2021-05-18 20:34:44.407772"]]