app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "fred"], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["friend_id", 7], ["created_at", "2021-07-12 13:42:33.941091"], ["updated_at", "2021-07-12 13:42:33.941091"]]
---
  def addFriend
    friend_username = user_params[:username]
    @friend = User.find_by(username: friend_username)
    # debugger
    if @friend.nil?
      # debugger
      render json: ['User does not exist!'], status: 401
    elsif @friend.id == current_user.id
      # debugger
      render json: ['You cannot friend yourself'], status: 401
    else
      # debugger
      @friendship = Friendship.new(user_id:current_user.id, friend_id: @friend.id)
      @friendship1 = Friendship.new(user_id:@friend.id, friend_id: current_user.id)

      if @friendship.save! && @friendship1.save!

SELECT "users".* FROM "users" WHERE (username ~ 'MAY' OR username ~ 'may' OR username ~ 'May')
---
  def searchUsers
    if params[:query].present?
      @friends = User.where('username ~ ? OR username ~ ? OR username ~ ?', params[:query].upcase, params[:query].downcase, params[:query].capitalize)