app/models/user.rb

SELECT "bills".* FROM "bills" INNER JOIN "billsplits" ON "billsplits"."bill_id" = "bills"."id" INNER JOIN "users" ON "users"."id" = "bills"."author_id" WHERE (author_id = 3) AND (recipient_paid = false) AND (paid = false)
SELECT "billsplits".* FROM "billsplits" WHERE "billsplits"."bill_id" = $1  [["bill_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def owed(current_user_id)

        owed_list = {}
        # debugger
        bills = Bill.joins(:bill_splits)
                    .joins(:bill_author)
                    .where('author_id = ?', current_user_id)
                    .where('recipient_paid = false')
                    .where('paid = false')

        bills.uniq.each do |bill|
            # debugger

            bill.bill_splits.each do |split|
                # debugger
                recipient_id = split.recipient_id
                recipient_username = User.find_by(id: recipient_id).username

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def owe(current_user_id)

        owe_list = {}
        # debugger
        billsplits = Billsplit
                    .joins(:bill)
                    .where('recipient_id = ?', current_user_id)
                    .where('recipient_paid = false')
                    .where('paid = false')

        billsplits.each do |bill|
            # debugger
            bill_author_id = Bill.find_by(id: bill.bill_id).author_id
            # debugger
            bill_author_name = User.find_by(id: bill_author_id).username