app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "gjDqdTfzNnL1A-uuaiP6lw"], ["updated_at", "2021-05-13 03:40:34.251616"], ["id", 8]]
---
    def reset_session_token!
    self.session_token = User.generate_session_token
    self.save